Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: Note that if there were a C<continue> block on the above code, it would get executed only on lines discarded by the regex (since redo skips the continue block).
es_es: Note que si existiese un bloque C<continue> en el código de arriba, sería ejecutado sólo en las líneas descartadas por la expresión regular (debido a que redo salta el bloque continue).

source: A continue block is often used to reset line counters or C<?pat?> one-time matches:
es_es: Un bloque continue se usa a menudo para resetear contadores de línea o patrones de un sólo uso:

source: # inspired by :1,$g/fred/s//WILMA/
es_es: # inspirado por :1,$g/fred/s//WILMA/

source: while (<>) { ?(fred)?
es_es: while (<>) { ?(pedro)?

source: && s//WILMA $1 WILMA/; ?(barney)?
es_es: && s//WILMA $1 WILMA/; ?(pablo)?

source: } continue { print "$ARGV $.: $_"; close ARGV if eof(); # reset $.
es_es: } continue { print "$ARGV $.: $_"; close ARGV if eof(); # resetea $.

source: reset if eof(); # reset ?pat?
es_es: reset if eof(); # resetea ?patrón?

source: If the word C<while> is replaced by the word C<until>, the sense of the test is reversed, but the conditional is still tested before the first iteration.
es_es: Si la palabra C<while> se reemplaza por la palabra C<until>, el sentido del test se invierte, pero la condición es testeada siempre antes de la primera iteración.

source: The loop control statements don't work in an C<if> or C<unless>, since they aren't loops.
es_es: Las sentencias de control de bucle no funcionan en un C<if> o C<unless>, porque no son bucles.

source: You can double the braces to make them such, though.
es_es: Aunque puede doblar las llaves para crearlos.

source: if (/pattern/) {{ last if /fred/; next if /barney/; # same effect as "last", but doesn't document as well # do something here
es_es: if (/patrón/) {{ last if /pedro/; next if /pablo/; # el mismo efecto que "last", pero no se ve muy claro # hacer algo aquí

source: This is caused by the fact that a block by itself acts as a loop that executes once, see L<"Basic BLOCKs and Switch Statements">.
es_es: Esto es causado por el hecho de que un bloque por sí mismo actúa como un bucle que se ejecuta una vez, ver L<"BLOQUES básicos y sentencias Switch">.

source: The form C<while/if BLOCK BLOCK>, available in Perl 4, is no longer available.
es_es: La forma C<while/if BLOQUE BLOQUE>, disponible en Perl 4, ya no lo está.

source: Replace any occurrence of C<if BLOCK> by C<if (do BLOCK)>.
es_es: Reemplace cada ocurrencia de C<if BLOQUE> por C<if (do BLOQUE)>.

source: =head2 For Loops X<for> X<foreach>
es_es: =head2 Bucles For X<for> X<foreach>

source: Perl's C-style C<for> loop works like the corresponding C<while> loop; that means that this:
es_es: El estilo C del bucle C<for> trabaja como el correspondiente bucle C<while>; esto quiere decir:

source: is the same as this:
es_es: es lo mismo que esto:

source: There is one minor difference: if variables are declared with C<my> in the initialization section of the C<for>, the lexical scope of those variables is exactly the C<for> loop (the body of the loop and the control sections).
es_es: Hay una pequeña diferencia: si hay variables declaradas con C<my> en la sección de inicialización del C<for>, el ámbito léxico de estas variables es exactamente el bucle C<for> (el cuerpo del bucle y las secciones de control).

source: Besides the normal array index looping, C<for> can lend itself to many other interesting applications.
es_es: Además del recorrido indexado de arrays, C<for> puede prestarse a otras interesantes aplicaciones.

source: Here's one that avoids the problem you get into if you explicitly test for end-of-file on an interactive file descriptor causing your program to appear to hang.
es_es: Aquí hay una que evita el problema al testear explícitamente por el fin de fichero en un descriptor de fichero interactivo, provocando que su programa parezca que se queda colgado.

source: X<eof> X<end-of-file> X<end of file>
es_es: X<eof> X<end-of-file> X<fin de fichero>

source: $on_a_tty = -t STDIN && -t STDOUT;
es_es: $en_un_tty = -t STDIN && -t STDOUT;

source: sub prompt { print "yes?
es_es: sub prompt { print "¿si?

source: " if $on_a_tty }
es_es: " if $en_un_tty }

source: for ( prompt(); <STDIN>; prompt() ) { # do something
es_es: for ( prompt(); <STDIN>; prompt() ) { # hacer algo

source: Using C<readline> (or the operator form, C<< <EXPR> >>) as the conditional of a C<for> loop is shorthand for the following.
es_es: Usando C<readline> (o el operador C<< <EXPR> >>) como la condición de un bucle C<for> es la forma corta de lo siguiente.

source: This behaviour is the same as a C<while> loop conditional.
es_es: Este comportamiento es el mismo que en la condición de un bucle C<while>.

source: # do something
es_es: # hacer algo

source: =head2 Foreach Loops X<for> X<foreach>
es_es: =head2 Bucles Foreach X<for> X<foreach>

source: The C<foreach> loop iterates over a normal list value and sets the variable VAR to be each element of the list in turn.
es_es: El bucle C<foreach> itera sobre los valores de una lista normal y pone la variable VAR a cada uno de los elementos de la lista.

source: If the variable is preceded with the keyword C<my>, then it is lexically scoped, and is therefore visible only within the loop.
es_es: Si la variable es precedida por la palabra clave C<my>, entonces su ámbito es léxicamente local y por eso es visible sólo dentro del bucle.

source: Otherwise, the variable is implicitly local to the loop and regains its former value upon exiting the loop.
es_es: Dicho de otra forma, la variable es implícitamente local al bucle y recupera su valor anterior saliendo del bucle.

source: If the variable was previously declared with C<my>, it uses that variable instead of the global one, but it's still localized to the loop.
es_es: Si la variable fue anteriormente declarada con C<my>, usa esta variable en vez de la global, pero sigue siendo local en el bucle.

source: This implicit localisation occurs I<only> in a C<foreach> loop.
es_es: Esta forma implícita de ser local ocurre I<solamente> en un bucle C<foreach>.

source: The C<foreach> keyword is actually a synonym for the C<for> keyword, so you can use C<foreach> for readability or C<for> for brevity.
es_es: La palabra clave C<foreach> es realmente un sinónimo de la palabra clave C<for>, así que puede usar C<foreach> por legibilidad o C<for> por brevedad.

source: (Or because the Bourne shell is more familiar to you than I<csh>, so writing C<for> comes more naturally.) If VAR is omitted, C<$_> is set to each value.
es_es: (O porque el shell Bourne le es más familiar que el I<csh>, escribir C<for> le es más natural). Si VAR se omite, C<$_> se inicializa a cada valor.

source: If any element of LIST is an lvalue, you can modify it by modifying VAR inside the loop.
es_es: Si cualquier elemento de LISTA es un I<lvalue> (un valor que puede ponerse en el lado izquierdo de una expresión de asignación), puede modificarlo modificando VAR dentro del bucle.

source: Conversely, if any element of LIST is NOT an lvalue, any attempt to modify that element will fail.
es_es: Recíprocamente, si cualquier elemento de LISTA NOT es un I<lvalue>, cualquier intento de modificar este elemento fallará (provocará un error).

source: In other words, the C<foreach> loop index variable is an implicit alias for each item in the list that you're looping over.
es_es: En otras palabras, la variable índice del bucle C<foreach> es implícitamente un alias de cada elemento de la lista sobre la que estás iterando.

source: If any part of LIST is an array, C<foreach> will get very confused if you add or remove elements within the loop body, for example with C<splice>.
es_es: Si cualquier parte de la LISTA es un array, C<foreach> quedará confundido si añade o quita elementos dentro del cuerpo del bucle, por ejemplo al usar C<splice>.

source: C<foreach> probably won't do what you expect if VAR is a tied or other special variable.
es_es: C<foreach> probablemente no hará lo esperado si VAR está enlazada a otra variable especial.

source: Don't do that either.
es_es: No haga esto tampoco.

source: for (@ary) { s/foo/bar/ }
es_es: for (@array) { s/foo/bar/ }

source: for my $elem (@elements) { $elem *= 2;
es_es: for my $elemento (@elementos) { $elemento *= 2;

# for $count (10,9,8,7,6,5,4,3,2,1,'BOOM') { print $count, " "; sleep(1);
source: for $count (10,9,8,7,6,5,4,3,2,1,'BOOM') { print $count, "\n"; sleep(1);
es_es: for $cuenta_atras (10,9,8,7,6,5,4,3,2,1,'BOOM') { print $cuenta_atras, "\n"; sleep(1);

# for (1..15) { print "Merry Christmas "; }
source: for (1..15) { print "Merry Christmas\n"; }
es_es: for (1..15) { print "Feliz Navidad\n"; }

source: Here's how a C programmer might code up a particular algorithm in Perl:
es_es: Aquí hay un ejemplo de cómo un programador de C codificaría un algoritmo particular en Perl:

source: for (my $i = 0; $i < @ary1; $i++) { for (my $j = 0; $j < @ary2; $j++) { if ($ary1[$i] > $ary2[$j]) { last; # can't go to outer :-( } $ary1[$i] += $ary2[$j]; } # this is where that last takes me
es_es: for (my $i = 0; $i < @array1; $i++) { for (my $j = 0; $j < @array2; $j++) { if ($array1[$i] > $array2[$j]) { last; # No puede volver al bucle más exterior :-( } $array1[$i] += $array2[$j]; } # Aquí es donde lleva el 'last'

source: Whereas here's how a Perl programmer more comfortable with the idiom might do it:
es_es: Y aquí está cómo un programador de Perl, más cómodo con el lenguaje, puede hacer:

source: OUTER: for my $wid (@ary1) {
es_es: EXTERNO: for my $wid (@array1) {

source: INNER: for my $jet (@ary2) { next OUTER if $wid > $jet; $wid += $jet; } }
es_es: INTERNO: for my $jet (@array2) { next EXTERNO if $wid > $jet; $wid += $jet; } }

source: See how much easier this is?
es_es: ¿Ha visto que es mucho más fácil?

source: It's cleaner, safer, and faster.
es_es: Es más limpio, seguro y rápido.

source: It's cleaner because it's less noisy.
es_es: Es más limpio porque es menos ruidoso.

source: It's safer because if code gets added between the inner and outer loops later on, the new code won't be accidentally executed.
es_es: Es más seguro porque si se añade nuevo código entre los bucles interno y externo, ese nuevo código no será ejecutado accidentalmente.

source: The C<next> explicitly iterates the other loop rather than merely terminating the inner one.
es_es: El C<next> explícitamente itera sobre el otro bucle en vez de meramente terminar el interno.

source: And it's faster because Perl executes a C<foreach> statement more rapidly than it would the equivalent C<for> loop.
es_es: Y es más rápido porque Perl ejecuta un sentencia C<foreach> más rápidamente que su equivalente en un bucle C<for>.

source: =head2 Basic BLOCKs and Switch Statements X<switch> X<block> X<case>
es_es: =head2 BLOQUES Básicos y Sentencias Switch X<switch> X<bloque> X<case>

source: A BLOCK by itself (labeled or not) is semantically equivalent to a loop that executes once.
es_es: Un BLOQUE por sí mismo (etiquetado o no) es semánticamente equivalente a un bucle que se ejecuta una vez.

source: Thus you can use any of the loop control statements in it to leave or restart the block.
es_es: Así que puede usar cualquiera de las sentencias de control de bucle dentro de él para salir o reiniciarlo.

source: (Note that this is I<NOT> true in C<eval{}>, C<sub{}>, or contrary to popular belief C<do{}> blocks, which do I<NOT> count as loops.) The C<continue> block is optional.
es_es: (Note que esto I<NO> es verdad en C<eval{}>, C<sub{}>, y contrariamente a la creencia popular, bloques C<do{}>, que I<NO> cuentan como bucles). El bloque C<continue> es opcional.

source: The BLOCK construct is particularly nice for doing case structures.
es_es: La construcción BLOQUE es particularmente bonita para hacer estructuras I<case>.

source: SWITCH: { if (/^abc/) { $abc = 1; last SWITCH; } if (/^def/) { $def = 1; last SWITCH; } if (/^xyz/) { $xyz = 1; last SWITCH; } $nothing = 1;
es_es: SWITCH: { if (/^abc/) { $abc = 1; last SWITCH; } if (/^def/) { $def = 1; last SWITCH; } if (/^xyz/) { $xyz = 1; last SWITCH; } $nada = 1;

source: There is no official C<switch> statement in Perl, because there are already several ways to write the equivalent.
es_es: No existe una sentencia oficial C<switch> en Perl, porque existen varias formas de escribir algo equivalente.

source: However, starting from Perl 5.8 to get switch and case one can use the Switch extension and say:
es_es: Sin embargo, uno puede obtener switch y case usando Perl 5.8 y superior usando la extensión Switch y diciendo:

source: after which one has switch and case.
es_es: después del cual ya se tiene switch y case.

source: It is not as fast as it could be because it's not really part of the language (it's done using source filters) but it is available, and it's very flexible.
es_es: No es tan rápido como se espera porque realmente no forma parte del lenguaje (se hace usando filtros del código fuente) pero está disponible y es muy flexible.

source: In addition to the above BLOCK construct, you could write
es_es: Además de la construcción del BLOQUE anterior, puede escribir esto

source: SWITCH: { $abc = 1, last SWITCH if /^abc/; $def = 1, last SWITCH if /^def/; $xyz = 1, last SWITCH if /^xyz/; $nothing = 1;
es_es: SWITCH: { $abc = 1, last SWITCH if /^abc/; $def = 1, last SWITCH if /^def/; $xyz = 1, last SWITCH if /^xyz/; $nada = 1;

source: (That's actually not as strange as it looks once you realize that you can use loop control "operators" within an expression.
es_es: (No es tan extraño como parece una vez que se de cuenta de que puede usar "operadores" de control de bucle dentro de una expresión.

source: That's just the binary comma operator in scalar context.
es_es: Esto es solamente el operador coma en contexto escalar.

source: See L<perlop/"Comma Operator">.)
es_es: Ver L<perlop/"Operador Coma">).

source: SWITCH: { /^abc/ && do { $abc = 1; last SWITCH; }; /^def/ && do { $def = 1; last SWITCH; }; /^xyz/ && do { $xyz = 1; last SWITCH; }; $nothing = 1;
es_es: SWITCH: { /^abc/ && do { $abc = 1; last SWITCH; }; /^def/ && do { $def = 1; last SWITCH; }; /^xyz/ && do { $xyz = 1; last SWITCH; }; $nada = 1;

source: or formatted so it stands out more as a "proper" C<switch> statement:
es_es: o formateado para que se parezca a una sentencia C<switch> más "limpia":

source: /^xyz/ && do { $xyz = 1; last SWITCH; }; $nothing = 1;
es_es: /^xyz/ && do { $xyz = 1; last SWITCH; }; $nada = 1;

source: SWITCH: { /^abc/ and $abc = 1, last SWITCH; /^def/ and $def = 1, last SWITCH; /^xyz/ and $xyz = 1, last SWITCH; $nothing = 1;
es_es: SWITCH: { /^abc/ and $abc = 1, last SWITCH; /^def/ and $def = 1, last SWITCH; /^xyz/ and $xyz = 1, last SWITCH; $nada = 1;

source: or even, horrors,
es_es: o incluso, horror,

source: else { $nothing = 1 }
es_es: else { $nada = 1 }

source: A common idiom for a C<switch> statement is to use C<foreach>'s aliasing to make a temporary assignment to C<$_> for convenient matching:
es_es: Un modismo común para una sentencia C<switch> es aliando la asignación temporal de C<$_> en un bucle C<foreach> para realizar el emparejamiento:

source: SWITCH: for ($where) { /In Card Names/ && do { push @flags, '-e'; last; }; /Anywhere/ && do { push @flags, '-h'; last; }; /In Rulings/ && do { last; }; die "unknown value for form variable where: `$where'"; }
es_es: SWITCH: for ($donde) { /En tarjetas/ && do { push @flags, '-e'; last; }; /Cualquiera/ && do { push @flags, '-h'; last; }; /En cartones/ && do { last; }; die "valor desconocido para la variable donde: `$donde'"; }

source: Another interesting approach to a switch statement is arrange for a C<do> block to return the proper value:
es_es: Otra interesando aproximación a una sentencia C<switch> es organizar un bloque C<do> para que devuelva el valor apropiado:

source: $amode = do { if ($flag & O_RDONLY) { "r" } # XXX: isn't this 0?
es_es: $acceso_modo = do { if ($flag & O_RDONLY) { "r" } # XXX: ¿esto no es 0?

source: Or
es_es: O

source: "write-only" :
es_es: "sólo escritura" :

source: "read-write" :
es_es: "lectura-escritura" :

source: "read-only";
es_es: "solo-lectura";

source: Or if you are certain that all the C<&&> clauses are true, you can use something like this, which "switches" on the value of the C<HTTP_USER_AGENT> environment variable.
es_es: O si está seguro de que todas las clausulas C<&&> son verdaderas, puede usar algo como esto, con "switches" en el valor de la variable de entorno C<HTTP_USER_AGENT>.

source: # pick out jargon file page based on browser
es_es: # Elige el fichero de la jerga según el navegador utilizado

source: for ($ENV{HTTP_USER_AGENT}) { $page = /Mac/ && 'm/Macintrash.html' || /Win(dows )?NT/ && 'e/evilandrude.html' || /Win|MSIE|WebTV/ && 'm/MicroslothWindows.html' || /Linux/ && 'l/Linux.html' || /HP-UX/ && 'h/HP-SUX.html' || /SunOS/ && 's/ScumOS.html' || 'a/AppendixB.html';
es_es: for ($ENV{HTTP_USER_AGENT}) { $pagina = /Mac/ && 'm/Macintrash.html' || /Win(dows )?NT/ && 'e/evilandrude.html' || /Win|MSIE|WebTV/ && 'm/MicroslothWindows.html' || /Linux/ && 'l/Linux.html' || /HP-UX/ && 'h/HP-SUX.html' || /SunOS/ && 's/ScumOS.html' || 'a/AppendixB.html';

source: print "Location: $dir/$page\015\012\015\012";
es_es: print "Location: $dir/$pagina\015\012\015\012";

source: That kind of switch statement only works when you know the C<&&> clauses will be true.
es_es: Esta clase de sentencia switch sólo funciona cuando sabe que las clausulas C<&&> serán verdaderas.

source: If you don't, the previous C<?:> example should be used.
es_es: Si no es así, el ejemplo anterior de C<?:> debe ser usado.

source: You might also consider writing a hash of subroutine references instead of synthesizing a C<switch> statement.
es_es: Podría también considerar escribir un hash de referencias a subrutinas para sintetizar una sentencia C<switch>.

source: Although not for the faint of heart, Perl does support a C<goto> statement.
es_es: Aunque no sea muy querido, Perl soporta la sentencia C<goto>.

source: There are three forms: C<goto>-LABEL, C<goto>-EXPR, and C<goto>-&NAME.
es_es: Existen tres formas: C<goto>-ETIQUETA, C<goto>-EXPR y C<goto>-&NOMBRE.

source: A loop's LABEL is not actually a valid target for a C<goto>; it's just the name of the loop.
es_es: La ETIQUETA de un bucle no es realmente un destino válido para un C<goto>; sólo es el nombre del bucle.

source: The C<goto>-LABEL form finds the statement labeled with LABEL and resumes execution there.
es_es: La forma C<goto>-ETIQUETA busca la sentencia etiquetada con ETIQUETA y continua la ejecución desde allí.

source: It also can't be used to go into a construct that is optimized away.
es_es: Tampoco puede ir en una construcción que esté optimizada.

source: The C<goto>-EXPR form expects a label name, whose scope will be resolved dynamically.
es_es: La forma C<goto>-EXPR espera un nombre de etiqueta, cuyo ámbito será resuelto dinámicamente.

source: The C<goto>-&NAME form is highly magical, and substitutes a call to the named subroutine for the currently running subroutine.
es_es: La forma C<goto>-&NOMBRE es altamente mágica y sustituye a una llamada a una subrutina con nombre desde la actual subrutina que se está ejecutando.

source: This is used by C<AUTOLOAD()> subroutines that wish to load another subroutine and then pretend that the other subroutine had been called in the first place (except that any modifications to C<@_> in the current subroutine are propagated to the other subroutine.) After the C<goto>, not even C<caller()> will be able to tell that this routine was called first.
es_es: Esto se usa por subrutinas C<AUTOLOAD()> que desean cargar otra subrutina y fingen que esta otra subrutina ha sido llamada en primer lugar (excepto que cualquier modificación a C<@_> en la subrutina actual se propaga a la otra). Después del C<goto>, ni siquiera C<caller()> será capaz de decir qué rutina fue llamada en primer lugar.

source: In almost all cases like this, it's usually a far, far better idea to use the structured control flow mechanisms of C<next>, C<last>, or C<redo> instead of resorting to a C<goto>.
es_es: En casi todos los casos como este, es usualmente una mejor, mejor idea, usar los mecanismos de control de flujo de C<next>, C<last> o C<redo> en vez de recurrir a C<goto>.

source: For certain applications, the catch and throw pair of C<eval{}> and die() for exception processing can also be a prudent approach.
es_es: Para ciertas aplicaciones, la pareja C<eval{}> y C<die()> puede ser un prudente planteamiento para el procesamiento de excepciones.

source: =head2 PODs: Embedded Documentation X<POD> X<documentation>
es_es: =head2 POD: Documentación Embebida X<POD> X<documentación>

source: Perl has a mechanism for intermixing documentation with source code.
es_es: Perl tiene un mecanismo para entremezclar documentación y código fuente.

source: While it's expecting the beginning of a new statement, if the compiler encounters a line that begins with an equal sign and a word, like this
es_es: Mientras que él espera el comienzo de una nueva sentencia, si el compilador encuentra una línea que comienza con un signo de igual y una palabra, como esta

source: =head1 Here There Be Pods!
es_es: =head1 Aquí serán los Pods!

source: Then that text and all remaining text up through and including a line beginning with C<=cut> will be ignored.
es_es: Entonces este texto y el siguiente hasta incluir una línea que comience por C<=cut> será ignorada.

source: The format of the intervening text is described in L<perlpod>.
es_es: El formato del texto intermedio está descrito en L<perlpod>.

source: This allows you to intermix your source code and your documentation text freely, as in
es_es: Esto le permite entremezclar código fuente y texto de la documentación libremente, como por ejemplo

source: The snazzle() function will behave in the most spectacular
es_es: La función snazzle() se convertirá en la más espectacular

source: form that you can possibly imagine, not even excepting
es_es: forma que pueda posiblemente imaginar, incluyendo

source: cybernetic pyrotechnics.
es_es: pirotecnia cibernética.

source: =cut back to the compiler, nuff of this pod stuff!
es_es: =cut devuelta al compilador, lejos de este material pod!

source: sub snazzle($) { my $thingie = shift; .........
es_es: sub snazzle($) { my $cosita = shift; .........

source: Note that pod translators should look at only paragraphs beginning with a pod directive (it makes parsing easier), whereas the compiler actually knows to look for pod escapes even in the middle of a paragraph.
es_es: Note que los traductores pod suelen mirar sólo en los párrafos que comiencen por una directiva pod (hace el parseo más fácil), mientras que el compilador realmente sabe mirar por las secuencias pod incluso en el medio de un párrafo.

source: This means that the following secret stuff will be ignored by both the compiler and the translators.
es_es: Esto significa que el siguiente material secreto será ignorado tanto por el compilador como por los traductores.

source: =secret stuff
es_es: =material secreto

source: warn "Neither POD nor CODE!?"
es_es: warn "Ni POD ni CÓDIGO!?"

source: =cut back
es_es: =cut regreso

# print "got $a ";
source: print "got $a\n";
es_es: print "tengo $a\n";

source: You probably shouldn't rely upon the C<warn()> being podded out forever.
es_es: Probablemente no se dará cuenta de que el C<warn()> ha sido comentado para siempre.

source: Not all pod translators are well-behaved in this regard, and perhaps the compiler will become pickier.
es_es: No todos los traductores pod están bien entrenados a este respecto y quizá el compilador sea más quisquilloso.
